# Pandas

In [1]:
import pandas as pd

Series

In [2]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series:\n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
#create a series from dictionary
data = {'a':1,'b':2,'c':3,'d':4}
series= pd.Series(data)
print(series)
print(type(series))

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

Dataframe

In [5]:
#create a Dataframe from a dictionary
data= {
    'Name':['Ali','Tom','Anu'],
    'Age':[20,25,30],
    'city':['malappuram','vengara','chemmad']
}
df=pd.DataFrame(data)

print(df)
print(type(df))

  Name  Age        city
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad
<class 'pandas.core.frame.DataFrame'>

In [6]:
import numpy as np
np.array(df)

array([['Ali', 20, 'malappuram'],
       ['Tom', 25, 'vengara'],
       ['Anu', 30, 'chemmad']], dtype=object)

In [7]:
# create a dataframe from a list of dictionary
data = [
    {'Name':'Ali','Age':20,'City':'malappuram'},
    {'Name':'Tom','Age':25,'City':'vengara'},
    {'Name':'Anu','Age':30,'City':'chemmad'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad
<class 'pandas.core.frame.DataFrame'>

In [8]:
# Accessing Data from Dataframe
df

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad

In [9]:
df['Name']

0    Ali
1    Tom
2    Anu
Name: Name, dtype: object

In [10]:
df.loc[1]

Name        Tom
Age          25
City    vengara
Name: 1, dtype: object

In [11]:
df.iloc[0]

Name           Ali
Age             20
City    malappuram
Name: 0, dtype: object

In [12]:
df.iloc[0][2]

/var/folders/1t/qqtm35950b74y6zwph6yt5vm0000gn/T/ipykernel_39105/42695711.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'malappuram'

In [13]:
#Accessing a specified elements
df.at[1,'City']

'vengara'

In [14]:
#Accessing a specified elements using iat
df.iat[2,0]

'Anu'

In [15]:
#Data manipulation with Dataframe
df

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad

In [16]:
#Adding a column
df['Salary']=[5000,6000,7000]
df

  Name  Age        City  Salary
0  Ali   20  malappuram    5000
1  Tom   25     vengara    6000
2  Anu   30     chemmad    7000

In [17]:
df.head(1)

  Name  Age        City  Salary
0  Ali   20  malappuram    5000

In [18]:
df.tail(1)

  Name  Age     City  Salary
2  Anu   30  chemmad    7000

In [19]:
#Remove a column
df.drop('Salary',axis=1,inplace=True)

In [20]:
df

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad

In [21]:
#Add age to the column
df['Age']=df['Age']+1

In [22]:
df

  Name  Age        City
0  Ali   21  malappuram
1  Tom   26     vengara
2  Anu   31     chemmad

In [23]:
df.drop(0)

  Name  Age     City
1  Tom   26  vengara
2  Anu   31  chemmad

In [24]:
df.describe()

        Age
count   3.0
mean   26.0
std     5.0
min    21.0
25%    23.5
50%    26.0
75%    28.5
max    31.0

In [25]:
# change column name
df=df.rename(columns={'Name':'Person_Name'})
df.head()

  Person_Name  Age        City
0         Ali   21  malappuram
1         Tom   26     vengara
2         Anu   31     chemmad

In [26]:
# change datatype 
df['new_age']=df['Age'].astype(float)
df.head()

  Person_Name  Age        City  new_age
0         Ali   21  malappuram     21.0
1         Tom   26     vengara     26.0
2         Anu   31     chemmad     31.0

In [27]:
df['New Value']=df['Age'].apply(lambda x:x*2)
df.head()

  Person_Name  Age        City  new_age  New Value
0         Ali   21  malappuram     21.0         42
1         Tom   26     vengara     26.0         52
2         Anu   31     chemmad     31.0         62

In [28]:
# Data Aggregating and Grouping
# .agg()

In [29]:
# merging and joining Dataframe
# Create simple Dataframe
df1 =pd.DataFrame({'key':['A','B','c'],'value1':[1,2,3]})
df2 =pd.DataFrame({'key':['A','B','D'],'value2':[4,5,6]})
df1

  key  value1
0   A       1
1   B       2
2   c       3

In [30]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [31]:
# merging Dataframe on the key column
pd.merge(df1,df2,on='key',how='inner')

  key  value1  value2
0   A       1       4
1   B       2       5

In [32]:
pd.merge(df1,df2,on='key',how='outer')

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   D     NaN     6.0
3   c     3.0     NaN

In [33]:
pd.merge(df1,df2,on='key',how='left')

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   c       3     NaN

In [34]:
pd.merge(df1,df2,on='key',how='right')

  key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

In [35]:
# Step 1: Create a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Score': [85, 72, 90],
    'Passed': [True, False, True]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name  Score  Passed
0    Alice     85    True
1      Bob     72   False
2  Charlie     90    True

In [36]:
# Step 2: Save to CSV
df.to_csv('students.csv', index=False)#writing

In [37]:
# Step 3: Read from CSV
df_loaded = pd.read_csv('students.csv')
print("\nLoaded DataFrame:")
print(df_loaded)

Loaded DataFrame:
      Name  Score  Passed
0    Alice     85    True
1      Bob     72   False
2  Charlie     90    True

In [38]:
print(df.info())        # Data types, non-null counts
print(df.describe())    # Summary stats for numeric columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Score   3 non-null      int64
 2   Passed  3 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 183.0+ bytes
None
           Score
count   3.000000
mean   82.333333
std     9.291573
min    72.000000
25%    78.500000
50%    85.000000
75%    87.500000
max    90.000000

In [39]:
print(df.columns)       # Column names
print(df.index)         # Index range

Index(['Name', 'Score', 'Passed'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

Reading Data From Different Sources

In [40]:
from io import StringIO

Data = '{"employee_name":"James","email":"james@email.com","job_profile":[{"title1":"Team Lead","title2":"Sr.Developer"}]}'
df=pd.read_json(StringIO(Data))

In [41]:
df

,employee_name,email,job_profile
0,James,james@email.com,"{'title1': 'Team Lead', 'title2': 'Sr.Developer'}"

In [42]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@email.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr.Developer"}}}'

In [43]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@email.com","job_profile":{"title1":"Team Lead","title2":"Sr.Developer"}}}'

In [44]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@email.com","job_profile":{"title1":"Team Lead","title2":"Sr.Developer"}}]'

In [45]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header = None)

In [46]:

df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [47]:
# df.to_csv("wine.csv")

In [48]:
!pip install lxml

Requirement already satisfied: lxml in /Users/fahimp/Desktop/Data_Analysis/.env/lib/python3.13/site-packages (6.0.2)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: pip install --upgrade pip

In [49]:
url = "https://www.fdic.gov/bank-failures/failed-bank-list"
df=pd.read_html(url)